Synwit-Co-Ltd/SWM341_Lib/SWM341_StdPeriph_Driver/CSL/SWM341_UsbHost_Lib/MTP/usbh_mtp.c
	case USBH_MTP_XFER_OP_REQ_WAIT:
		resp = USBH_State();
		if(resp == USBR_ACK)
		{
			USBH_MTP_Info.OutEpDATAX ^= 1;
			
			if(USBH_MTP_Info.flags == PTP_DP_NODATA)
			{
				USBH_MTP_Info.XferState = USBH_MTP_XFER_RESP;
			}
			else if(USBH_MTP_Info.flags == PTP_DP_SENDDATA)
			{
				USBH_MTP_Info.XferState = USBH_MTP_XFER_DATA_OUT;
			}
			else if(USBH_MTP_Info.flags == PTP_DP_GETDATA)
			{
				USBH_MTP_Info.XferState = USBH_MTP_XFER_DATA_IN;
			}
		}
		else if(resp == USBR_NAK)
		{
			USBH_MTP_Info.XferState = USBH_MTP_XFER_OP_REQ;		// Resend Request
		}
		else if(resp == USBR_STALL)
		{
			USBH_MTP_Info.XferState = USBH_MTP_XFER_ERROR;
		}
		break;

	case USBH_MTP_XFER_DATA_OUT:
		size = USBH_MTP_Info.data_len > USBH_MTP_Info.OutEpSize ? USBH_MTP_Info.OutEpSize : USBH_MTP_Info.data_len;
		if(USBH_SendOutPacket(phost->Device.Address, USBH_MTP_Info.OutEp, USBH_MTP_Info.OutEpDATAX, USBH_MTP_Info.data_ptr, size))
		{
			USBH_MTP_Info.XferState  = USBH_MTP_XFER_DATA_OUT_WAIT;
		}
		break;

	case USBH_MTP_XFER_DATA_OUT_WAIT:
		resp = USBH_State();
		if(resp == USBR_ACK)
		{
			USBH_MTP_Info.OutEpDATAX ^= 1;
			
			if(USBH_MTP_Info.data_len > USBH_MTP_Info.OutEpSize)
			{
				USBH_MTP_Info.data_ptr += USBH_MTP_Info.OutEpSize;
				USBH_MTP_Info.data_len -= USBH_MTP_Info.OutEpSize;
			}
			else
			{
				USBH_MTP_Info.data_len = 0;
			}

			if(USBH_MTP_Info.data_len > 0)
			{
				USBH_MTP_Info.XferState = USBH_MTP_XFER_DATA_OUT;
			}
			else
			{
				USBH_MTP_Info.XferState = USBH_MTP_XFER_RESP;
			}
		}
		else if(resp == USBR_NAK)
		{
			USBH_MTP_Info.XferState = USBH_MTP_XFER_DATA_OUT;		// Resend same data
			
			USBH_MTP_Info.state = USBH_MTP_EVENT_CHECK;		// When device returns NAK, host checks to see if the Event query needs to be executed
		}
		else if(resp == USBR_STALL)
		{
			USBH_MTP_Info.XferState = USBH_MTP_XFER_ERROR;
		}
		break;

	case USBH_MTP_XFER_DATA_IN:
		if(USBH_SendInPacket(phost->Device.Address, USBH_MTP_Info.InEp, USBH_MTP_Info.InEpDATAX, USBH_MTP_Info.InEpSize))
		{
			USBH_MTP_Info.XferState  = USBH_MTP_XFER_DATA_IN_WAIT;
		}
		break;

	case USBH_MTP_XFER_DATA_IN_WAIT:
		resp = USBH_State();
		if(resp == USBR_ACK)
		{
			USBH_MTP_Info.InEpDATAX ^= 1;
			
			uint32_t len = USBH_ReadRxBuffer(USBH_MTP_Info.data_ptr, USBH_MTP_Info.InEpSize);

			if(USBH_MTP_Info.first_packet)
			{
				USBH_MTP_Info.data_len = *(uint32_t *)(void *)USBH_MTP_Info.data_ptr;
				
				if(USBH_MTP_Info.first_packet == 3)
				{
					len -= PTP_USB_BULK_HDR_LEN;
					USBH_MTP_Info.data_len -= PTP_USB_BULK_HDR_LEN;
					memcpy(USBH_MTP_Info.data_ptr, USBH_MTP_Info.data_ptr + PTP_USB_BULK_HDR_LEN, len);
				}
				
				USBH_MTP_Info.first_packet = 0;
			}
			
			USBH_MTP_Info.data_ptr += len;
			USBH_MTP_Info.data_len -= len;

			if((USBH_MTP_Info.data_len > 0) || (len == USBH_MTP_Info.InEpSize))
			{
				USBH_MTP_Info.XferState = USBH_MTP_XFER_DATA_IN;
			}
			else
			{
				USBH_MTP_Info.XferState = USBH_MTP_XFER_RESP;
			}
		}
		else if(resp == USBR_NAK)
		{
			USBH_MTP_Info.XferState = USBH_MTP_XFER_DATA_IN;
			
			USBH_MTP_Info.state = USBH_MTP_EVENT_CHECK;		// When device returns NAK, host checks to see if the Event query needs to be executed
		}
		else if(resp == USBR_STALL)
		{
			USBH_MTP_Info.XferState = USBH_MTP_XFER_ERROR;
		}
		break;

	case USBH_MTP_XFER_RESP:
		if(USBH_SendInPacket(phost->Device.Address, USBH_MTP_Info.InEp, USBH_MTP_Info.InEpDATAX, USBH_MTP_Info.InEpSize))
		{
			USBH_MTP_Info.XferState = USBH_MTP_XFER_RESP_WAIT;
		}
		break;

	case USBH_MTP_XFER_RESP_WAIT:
		resp = USBH_State();
		if(resp == USBR_ACK)
		{
			USBH_MTP_Info.InEpDATAX ^= 1;
			
			USBH_ReadRxBuffer((uint8_t *)&USBH_MTP_Info.resp_container, USBH_MTP_Info.InEpSize);
			
			if(USBH_MTP_Info.resp_container.code == PTP_RC_OK)
			{
				USBH_MTP_Info.XferStatus = USBH_OK;
			}
			else
			{
				USBH_MTP_Info.XferStatus = USBH_FAIL;
			}
			USBH_MTP_Info.state = USBH_MTP_Info.stateBkp;
		}
		else if(resp == USBR_NAK)
		{
			USBH_MTP_Info.XferState = USBH_MTP_XFER_RESP;
		}
		else if(resp == USBR_STALL)
		{
			USBH_MTP_Info.XferState = USBH_MTP_XFER_ERROR;
		}
		break;

	case USBH_MTP_XFER_ERROR:
		USBH_MTP_Info.XferStatus = USBH_FAIL;
		USBH_MTP_Info.state = USBH_MTP_Info.stateBkp;
		break;

	default:
		break;
	}
}

/*******************************************************************************************************************************
* @brief	USB host MTP get device info
* @param
* @return
*******************************************************************************************************************************/
USBH_Status USBH_MTP_GetDeviceInfo(USBH_Info_t *phost, PTP_DeviceInfo_t *dev_info)
{
	USBH_Status status = USBH_BUSY;

	switch(USBH_MTP_Info.OpState)
	{
	case USBH_MTP_OP_SEND:
		/* Set operation request type */
		USBH_MTP_Info.flags = PTP_DP_GETDATA;
		USBH_MTP_Info.data_ptr = (uint8_t *)(void *)&USBH_MTP_Info.data_container;
		USBH_MTP_Info.data_len = 0;
		USBH_MTP_Info.first_packet = 1;

		/* Fill operation request params */
		USBH_MTP_Info.op_container.type = PTP_USB_CONTAINER_COMMAND;
		USBH_MTP_Info.op_container.code = PTP_OC_GetDeviceInfo;
		USBH_MTP_Info.op_container.trans_id = USBH_MTP_Info.transaction_id++;
		USBH_MTP_Info.op_container.length = PTP_USB_BULK_HDR_LEN + sizeof(uint32_t) * 0;

		/* Setup State machine and start transfer */
		USBH_MTP_Info.XferState = USBH_MTP_XFER_OP_REQ;
		USBH_MTP_Info.OpState = USBH_MTP_OP_WAIT;
		
		USBH_MTP_Info.stateReq = USBH_MTP_TRANSFER;
		break;

	case USBH_MTP_OP_WAIT:
		if(USBH_MTP_Info.XferStatus != USBH_BUSY)
		{
			status = USBH_MTP_Info.XferStatus;
			USBH_MTP_Info.XferStatus = USBH_BUSY;

			USBH_MTP_Info.OpState = USBH_MTP_OP_SEND;
		}
		if(status == USBH_OK)
		{
			PTP_DecodeDeviceInfo(phost, dev_info);
		}
		break;

	default:
		break;
	}
	return status;
}

/*******************************************************************************************************************************
* @brief	USB host MTP open session
* @param
* @return
*******************************************************************************************************************************/
USBH_Status USBH_MTP_OpenSession(USBH_Info_t *phost, uint32_t session)
{
	USBH_Status status = USBH_BUSY;

